# Conociendo Sqlite3

## Creo una BD

## Material:
 - https://sqlitestudio.pl/
 - https://docs.python.org/3/library/sqlite3.html

### Para crear o conectarnos a una BD en Sqlite3 es la misma sentencia.

In [1]:
import sqlite3

In [2]:
con = sqlite3.connect('example.db')

In [4]:
con = sqlite3.connect('DB_Clase.db')

### Para crear una tabla e insertar datos

In [5]:
cur = con.cursor()

# Create table
cur.execute('''CREATE TABLE products
               (ProductID int, ProductName text, SupplierID int, CategoryID int, Unit text, Price real)''')

# Insert a row of data
cur.execute("INSERT INTO products VALUES (78, 'Queso Crema', 2, 4, '1 kg pkg.', 30)")

# Save (commit) the changes
con.commit()

# We can also close the connection if we are done with it.
# Just be sure any changes have been committed or they will be lost.
con.close()

### Para insertar mas datos...

In [7]:
con = sqlite3.connect('DB_Clase.db')

In [8]:
cur = con.cursor()

# Insert a row of data
cur.execute("INSERT INTO products VALUES (78, 'Queso Crema', 2, 4, '1 kg pkg.', 30)")

#### Voy a chequear si se agrego el registro... y?

In [9]:
# Insert a row of data
cur.execute("INSERT INTO products VALUES (78, 'Queso Crema', 2, 4, '1 kg pkg.', 30)")

con.commit()

#### Ahora vuelvo a chequear, cuantos registros se agregaron?

### Inserto con Roll Back!

In [13]:
cur = con.cursor()

# Insert a row of data
cur.execute("INSERT INTO products VALUES (80, 'Queso Crema', 2, 4, '1 kg pkg.', 30)")

In [11]:
con.rollback()

In [14]:
# Insert a row of data
cur.execute("INSERT INTO products VALUES (78, 'Queso Crema', 2, 4, '1 kg pkg.', 30)")

con.commit()

### Y si quiero hacer un update?

In [15]:
# Insert a row of data
cur.execute("INSERT INTO products VALUES (78, 'Queso Cremasss', 24, 4, '1 kg pkg.', 30)")

con.commit()

In [16]:
# Insert a row of data
cur.execute('''UPDATE products 
            SET ProductName = 'Queso Crema',
                SupplierID = 2
            WHERE SupplierID = 24
            ''')
con.commit()

#### Y si quiero borrar?

In [22]:
# Insert a row of data
cur.execute("INSERT INTO products VALUES (79, 'Queso Crema', 2, 4, '1 kg pkg.', 30)")

con.commit()

In [18]:
# Insert a row of data
cur.execute('''DELETE FROM Products
                WHERE ProductID >= 79;
            ''')

con.commit()

In [19]:
for row in cur.execute("SELECT * FROM Products"):
        print(row)

(78, 'Queso Crema', 2, 4, '1 kg pkg.', 30.0)
(78, 'Queso Crema', 2, 4, '1 kg pkg.', 30.0)
(78, 'Queso Crema', 2, 4, '1 kg pkg.', 30.0)
(78, 'Queso Crema', 2, 4, '1 kg pkg.', 30.0)
(78, 'Queso Crema', 2, 4, '1 kg pkg.', 30.0)
(78, 'Queso Crema', 2, 4, '1 kg pkg.', 30.0)

## Y Pandas? No tiene nada que ver con todo esto? ;)

In [20]:
import pandas as pd

In [24]:
query = "SELECT * FROM Products WHERE ProductID = 79"
pd.read_sql(query, con)

   ProductID  ProductName  SupplierID  CategoryID       Unit  Price
0         79  Queso Crema           2           4  1 kg pkg.   30.0

In [25]:
query = "SELECT * FROM Products"
new_data = pd.read_sql(query, con)

In [26]:
new_data

   ProductID  ProductName  SupplierID  CategoryID       Unit  Price
0         78  Queso Crema           2           4  1 kg pkg.   30.0
1         78  Queso Crema           2           4  1 kg pkg.   30.0
2         78  Queso Crema           2           4  1 kg pkg.   30.0
3         78  Queso Crema           2           4  1 kg pkg.   30.0
4         78  Queso Crema           2           4  1 kg pkg.   30.0
5         78  Queso Crema           2           4  1 kg pkg.   30.0
6         79  Queso Crema           2           4  1 kg pkg.   30.0

In [27]:
new_data['Price'] = new_data['Price'] * .95
new_data

   ProductID  ProductName  SupplierID  CategoryID       Unit  Price
0         78  Queso Crema           2           4  1 kg pkg.   28.5
1         78  Queso Crema           2           4  1 kg pkg.   28.5
2         78  Queso Crema           2           4  1 kg pkg.   28.5
3         78  Queso Crema           2           4  1 kg pkg.   28.5
4         78  Queso Crema           2           4  1 kg pkg.   28.5
5         78  Queso Crema           2           4  1 kg pkg.   28.5
6         79  Queso Crema           2           4  1 kg pkg.   28.5

In [29]:
try:
    new_data.to_sql('products', con, if_exists='fail',
                index=True, index_label=None, chunksize=None, dtype=None, method=None)
except:
    print("Algo anduvo mal :|")

Algo anduvo mal :|

In [30]:
new_data.to_sql("products", con, schema=None, 
                if_exists='append', index=False, index_label=None, chunksize=None, dtype=None, method=None)